Revit 2027 API
FamilyManager.RemoveParameter Method
Remove an existing family parameter from the family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveParameter(
	FamilyParameter familyParameter
)
Public Sub RemoveParameter (
	familyParameter As FamilyParameter
)
public:
void RemoveParameter(
	FamilyParameter^ familyParameter
)
member RemoveParameter :
        familyParameter : FamilyParameter -> unit
Parameters
familyParameter FamilyParameter
The family parameter.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
ArgumentException |  Thrown when the input argument-"familyParameter"-is an invalid parameter or a builtIn parameter.
InvalidOperationException |  Thrown when the family parameter deletion failed.
Remarks
Only family and shared parameters may be removed, built-in parameters may not be removed. If the parameter is used in any formulas, those formulas will be automatically removed along with the parameter.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace